Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 * Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex.c
 *    ConnectX-2 HCA nexus attach/detach Routines
 *
 *    Implements all the routines necessary for the attach, setup,
 *    initialization (and subsequent possible teardown and detach) of the
 *    ConnectX-2 HCA nexus driver.
 */

#include <sys/types.h>
#include <sys/file.h>
#include <sys/open.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/stat.h>
#include <sys/pci.h>
#include <sys/pci_cap.h>
#include <sys/bitmap.h>
#include <sys/policy.h>
#include <sys/sdt.h>
#include <sys/sunndi.h>

#include "mcxnex.h"

/* The following works around a problem in pre-2_7_000 firmware. */
#define	MCXNEXUS_FW_WORKAROUND

int mcxnex_verbose = 0;

/* Nexus State Pointer */
void *mcxnex_statep;

int debug_vpd = 0;

/* Disable the internal error-check polling thread */
int mcxnex_no_inter_err_chk = 0;

/*
 * The Mcxnex "userland resource database" is common to instances of the
 * Mcxnex HCA driver.  This structure "mcxnex_userland_rsrc_db" contains all
 * the necessary information to maintain it.
 */
mcxnex_umap_db_t mcxnex_userland_rsrc_db;

static int mcxnex_attach(dev_info_t *, ddi_attach_cmd_t);
static int mcxnex_detach(dev_info_t *, ddi_detach_cmd_t);
static int mcxnex_open(dev_t *, int, int, cred_t *);
static int mcxnex_close(dev_t, int, int, cred_t *);
static int mcxnex_getinfo(dev_info_t *, ddi_info_cmd_t, void *, void **);

static int mcxnex_drv_init(mcxnex_state_t *, dev_info_t *, int);
static void mcxnex_drv_fini(mcxnex_state_t *);
static void mcxnex_drv_fini2(mcxnex_state_t *);
static int mcxnex_isr_init(mcxnex_state_t *);
static void mcxnex_isr_fini(mcxnex_state_t *);

static int mcxnex_hw_init(mcxnex_state_t *);

static void mcxnex_hw_fini(mcxnex_state_t *, mcxnex_drv_cleanup_level_t);
static int mcxnex_soft_state_init(mcxnex_state_t *);
static void mcxnex_soft_state_fini(mcxnex_state_t *);
static int mcxnex_icm_config_setup(mcxnex_state_t *,
    mcxnex_hw_initqueryhca_t *);
static void mcxnex_icm_tables_init(mcxnex_state_t *);
static void mcxnex_icm_tables_fini(mcxnex_state_t *);
static int mcxnex_icm_dma_init(mcxnex_state_t *);
static void mcxnex_icm_dma_fini(mcxnex_state_t *);
static void mcxnex_inithca_set(mcxnex_state_t *, mcxnex_hw_initqueryhca_t *);
static int mcxnex_hca_ports_shutdown(mcxnex_state_t *, uint_t);
static int mcxnex_internal_uarpg_init(mcxnex_state_t *);
static void mcxnex_internal_uarpg_fini(mcxnex_state_t *);
static int mcxnex_special_qp_contexts_reserve(mcxnex_state_t *);
static void mcxnex_special_qp_contexts_unreserve(mcxnex_state_t *);
static int mcxnex_sw_reset(mcxnex_state_t *);
static int mcxnex_mcg_init(mcxnex_state_t *);
static void mcxnex_mcg_fini(mcxnex_state_t *);
static int mcxnex_fw_version_check(mcxnex_state_t *);
static void mcxnex_device_info_report(mcxnex_state_t *);
static int mcxnex_pci_capability_list(mcxnex_state_t *, ddi_acc_handle_t);
static void mcxnex_pci_capability_vpd(mcxnex_state_t *, ddi_acc_handle_t,
    uint_t);
static int mcxnex_pci_read_vpd(ddi_acc_handle_t, uint_t, uint32_t, uint32_t *);
static int mcxnex_intr_or_msi_init(mcxnex_state_t *);
static int mcxnex_add_intrs(mcxnex_state_t *, int);
static int mcxnex_intr_or_msi_fini(mcxnex_state_t *);
void mcxnex_pci_capability_msix(mcxnex_state_t *, ddi_acc_handle_t, uint_t);

static uint64_t mcxnex_size_icm(mcxnex_state_t *);

/* X86 fastreboot support */
static ushort_t get_msix_ctrl(dev_info_t *);
static size_t get_msix_tbl_size(dev_info_t *);
static size_t get_msix_pba_size(dev_info_t *);
static void mcxnex_set_msix_info(mcxnex_state_t *);
static int mcxnex_intr_disable(mcxnex_state_t *);
static int mcxnex_quiesce(dev_info_t *);
static int mcxnex_attach_ether(mcxnex_state_t *, int);
static int mcxnex_bus_ctl(dev_info_t *, dev_info_t *, ddi_ctl_enum_t,
    void *, void *);
static int mcxnex_bus_config(dev_info_t *, uint_t, ddi_bus_config_op_t,
    void *, dev_info_t **);
static int mcxnex_bus_unconfig(dev_info_t *, uint_t, ddi_bus_config_op_t,
    void *);


/* Character/Block Operations */
static struct cb_ops mcxnex_cb_ops = {
	mcxnex_open,		/* open */
	mcxnex_close,		/* close */
	nodev,			/* strategy (block) */
	nodev,			/* print (block) */
	nodev,			/* dump (block) */
	nodev,			/* read */
	nodev,			/* write */
	mcxnex_ioctl,		/* ioctl */
	NULL,			/* devmap */
	NULL,			/* mmap */
	nodev,			/* segmap */
	nochpoll,		/* chpoll */
	ddi_prop_op,		/* prop_op */
	NULL,			/* streams */
	D_NEW | D_MP |
	D_64BIT | D_DEVMAP,	/* flags */
	CB_REV			/* rev */
};

/* Bus Operations */
static struct bus_ops mcxnex_bus_ops = {
	BUSO_REV,		/* busops_rev */
	nullbusmap,		/* bus_map */
	NULL,			/* bus_get_intrspec (OBSOLETE) */
	NULL,			/* bus_add_intrspec (OBSOLETE) */
	NULL,			/* bus_remove_intrspec (OBSOLETE) */
	i_ddi_map_fault,	/* bus_map_fault */
	ddi_dma_map,		/* bus_dma_map */
	ddi_dma_allochdl,	/* bus_dma_allochdl */
	ddi_dma_freehdl,	/* bus_dma_freehdl */
	ddi_dma_bindhdl,	/* bus_dma_bindhdl */
	ddi_dma_unbindhdl,	/* bus_dma_unbindhdl */
	ddi_dma_flush,		/* bus_dma_flush */
	ddi_dma_win,		/* bus_dma_win */
	ddi_dma_mctl,		/* bus_dma_ctl */
	mcxnex_bus_ctl,		/* bus_ctl */
	ddi_bus_prop_op,	/* bus_prop_op */
	NULL,			/* bus_get_eventcookie */
	NULL,			/* bus_add_eventcall */
	NULL,			/* bus_remove_eventcall */
	NULL,			/* bus_post_event */
	NULL,			/* bus_intr_ctl (OBSOLETE) */
	mcxnex_bus_config, 	/* bus_config */
	mcxnex_bus_unconfig,	/* bus_unconfig */
	NULL,			/* bus_fm_init */
	NULL,			/* bus_fm_fini */
	NULL,			/* bus_fm_access_enter */
	NULL,			/* bus_fm_access_exit */
	NULL,			/* bus_power */
	NULL,			/* bus_intr_op */
};

/* Driver Operations */
static struct dev_ops mcxnex_ops = {
	DEVO_REV,		/* struct rev */
	0,			/* refcnt */
	mcxnex_getinfo,		/* getinfo */
	nulldev,		/* identify */
	nulldev,		/* probe */
	mcxnex_attach,		/* attach */
	mcxnex_detach,		/* detach */
	nodev,			/* reset */
	&mcxnex_cb_ops,		/* cb_ops */
	&mcxnex_bus_ops,	/* bus_ops */
	nodev,			/* power */
	mcxnex_quiesce,		/* devo_quiesce */
};

