Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
/* Module Driver Info */
static struct modldrv mcxnex_modldrv = {
	&mod_driverops,
	"Mellanox ConnectX-2 Nexus Driver",
	&mcxnex_ops
};

/* Module Linkage */
static struct modlinkage mcxnex_modlinkage = {
	MODREV_1,
	&mcxnex_modldrv,
	NULL
};


/*
 * _init()
 */
int
_init(void)
{
	int	status;

	status = ddi_soft_state_init(&mcxnex_statep, sizeof (mcxnex_state_t),
	    (size_t)MCXNEX_INITIAL_STATES);
	if (status != 0) {
		return (status);
	}

	status = mod_install(&mcxnex_modlinkage);
	if (status != 0) {
		ddi_soft_state_fini(&mcxnex_statep);
		return (status);
	}

	/* Initialize the Mcxnex "userland resources database" */
	mcxnex_umap_db_init();

	return (status);
}


/*
 * _info()
 */
int
_info(struct modinfo *modinfop)
{
	return (mod_info(&mcxnex_modlinkage, modinfop));
}


/*
 * _fini()
 */
int
_fini(void)
{
	int	status;

	status = mod_remove(&mcxnex_modlinkage);
	if (status != 0) {
		return (status);
	}

	/* Destroy the Mcxnex "userland resources database" */
	mcxnex_umap_db_fini();

	ddi_soft_state_fini(&mcxnex_statep);

	return (status);
}


/*
 * mcxnex_getinfo()
 */
static int
mcxnex_getinfo(dev_info_t *dip, ddi_info_cmd_t cmd, void *arg, void **result)
{
	dev_t		dev;
	mcxnex_state_t 	*state;
	minor_t		instance;

	_NOTE(ARGUNUSED(dip));

	switch (cmd) {
	case DDI_INFO_DEVT2DEVINFO:
		dev = (dev_t)arg;
		instance = MCXNEX_DEV_INSTANCE(dev);
		state = ddi_get_soft_state(mcxnex_statep, instance);
		if (state == NULL) {
			return (DDI_FAILURE);
		}
		*result = (void *)state->hs_dip;
		return (DDI_SUCCESS);

	case DDI_INFO_DEVT2INSTANCE:
		dev = (dev_t)arg;
		instance = MCXNEX_DEV_INSTANCE(dev);
		*result = (void *)(uintptr_t)instance;
		return (DDI_SUCCESS);

	default:
		break;
	}

	return (DDI_FAILURE);
}


/*
 * mcxnex_open()
 */
/* ARGSUSED */
static int
mcxnex_open(dev_t *devp, int flag, int otyp, cred_t *credp)
{
	mcxnex_state_t		*state;
	mcxnex_rsrc_t 		*rsrcp;
	mcxnex_umap_db_entry_t	*umapdb, *umapdb2;
	minor_t			instance;
	uint64_t		key, value;
	uint_t			hr_indx;
	dev_t			dev;
	int			status;

	instance = MCXNEX_DEV_INSTANCE(*devp);
	state = ddi_get_soft_state(mcxnex_statep, instance);
	if (state == NULL) {
		return (ENXIO);
	}

	if (otyp == OTYP_LYR) {
		/*
		 * The 10GbE driver opens us with a layered open to hold
		 * the instance active.  We don't actually do any work, since
		 * this open is purely for the benefit of the DDI.
		 */
		return (0);
	}

	/*
	 * Only allow driver to be opened for character access, and verify
	 * whether exclusive access is allowed.
	 */
	if ((otyp != OTYP_CHR) || ((flag & FEXCL) &&
	    secpolicy_excl_open(credp) != 0)) {
		return (EINVAL);
	}

	/*
	 * Search for the current process PID in the "userland resources
	 * database".  If it is not found, then attempt to allocate a UAR
	 * page and add the ("key", "value") pair to the database.
	 * Note:  As a last step we always return a devp appropriate for
	 * the open.  Either we return a new minor number (based on the
	 * instance and the UAR page index) or we return the current minor
	 * number for the given client process.
	 *
	 * We also add an entry to the database to allow for lookup from
	 * "dev_t" to the current process PID.  This is necessary because,
	 * under certain circumstance, the process PID that calls the Mcxnex
	 * close() entry point may not be the same as the one who called
	 * open().  Specifically, this can happen if a child process calls
	 * the Mcxnex's open() entry point, gets a UAR page, maps it out (using
	 * mmap()), and then exits without calling munmap().  Because mmap()
	 * adds a reference to the file descriptor, at the exit of the child
	 * process the file descriptor is "inherited" by the parent (and will
	 * be close()'d by the parent's PID only when it exits).
	 *
	 * Note: We use the mcxnex_umap_db_find_nolock() and
	 * mcxnex_umap_db_add_nolock() database access routines below (with
	 * an explicit mutex_enter of the database lock - "hdl_umapdb_lock")
	 * to ensure that the multiple accesses (in this case searching for,
	 * and then adding _two_ database entries) can be done atomically.
	 */
	key = ddi_get_pid();
	mutex_enter(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	status = mcxnex_umap_db_find_nolock(instance, key,
	    MLNX_UMAP_UARPG_RSRC, &value, 0, NULL);
	if (status != DDI_SUCCESS) {
		/*
		 * If we are in 'maintenance mode', we cannot alloc a UAR page.
		 * But we still need some rsrcp value, and a mostly unique
		 * hr_indx value.  So we set rsrcp to NULL for maintenance
		 * mode, and use a rolling count for hr_indx.  The field
		 * 'hs_open_hr_indx' is used only in this maintenance mode
		 * condition.
		 *
		 * Otherwise, if we are in operational mode then we allocate
		 * the UAR page as normal, and use the rsrcp value and tr_indx
		 * value from that allocation.
		 */
		if (!MCXNEX_IS_OPERATIONAL(state->hs_operational_mode)) {
			rsrcp = NULL;
			hr_indx = state->hs_open_ar_indx++;
		} else {
			/* Allocate a new UAR page for this process */
			status = mcxnex_rsrc_alloc(state, MCXNEX_UARPG, 1,
			    DDI_NOSLEEP, &rsrcp);
			if (status != DDI_SUCCESS) {
				mutex_exit(
				    &mcxnex_userland_rsrc_db.hdl_umapdb_lock);
				return (EAGAIN);
			}

			hr_indx = rsrcp->hr_indx;
		}

		/*
		 * Allocate an entry to track the UAR page resource in the
		 * "userland resources database".
		 */
		umapdb = mcxnex_umap_db_alloc(instance, key,
		    MLNX_UMAP_UARPG_RSRC, (uint64_t)(uintptr_t)rsrcp);
		if (umapdb == NULL) {
			mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
			/* If in "maintenance mode", don't free the rsrc */
			if (MCXNEX_IS_OPERATIONAL(state->hs_operational_mode)) {
				mcxnex_rsrc_free(state, &rsrcp);
			}
			return (EAGAIN);
		}

		/*
		 * Create a new device number.  Minor number is a function of
		 * the UAR page index (15 bits) and the device instance number
		 * (3 bits).
		 */
		dev = makedevice(getmajor(*devp), (hr_indx <<
		    MCXNEX_MINORNUM_SHIFT) | instance);

		/*
		 * Allocate another entry in the "userland resources database"
		 * to track the association of the device number (above) to
		 * the current process ID (in "key").
		 */
		umapdb2 = mcxnex_umap_db_alloc(instance, dev,
		    MLNX_UMAP_PID_RSRC, (uint64_t)key);
		if (umapdb2 == NULL) {
			mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
			mcxnex_umap_db_free(umapdb);
			/* If in "maintenance mode", don't free the rsrc */
			if (MCXNEX_IS_OPERATIONAL(state->hs_operational_mode)) {
				mcxnex_rsrc_free(state, &rsrcp);
			}
			return (EAGAIN);
		}

		/* Add the entries to the database */
		mcxnex_umap_db_add_nolock(umapdb);
		mcxnex_umap_db_add_nolock(umapdb2);

	} else {
		/*
		 * Return the same device number as on the original open()
		 * call.  This was calculated as a function of the UAR page
		 * index (top 16 bits) and the device instance number
		 */
		rsrcp = (mcxnex_rsrc_t *)(uintptr_t)value;
		dev = makedevice(getmajor(*devp), (rsrcp->hr_indx <<
		    MCXNEX_MINORNUM_SHIFT) | instance);
	}
	mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);

	*devp = dev;

	return (0);
}


