Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
/*
 * mcxnex_close()
 */
/* ARGSUSED */
static int
mcxnex_close(dev_t dev, int flag, int otyp, cred_t *credp)
{
	mcxnex_state_t		*state;
	mcxnex_rsrc_t		*rsrcp;
	mcxnex_umap_db_entry_t	*umapdb;
	mcxnex_umap_db_priv_t	*priv;
	minor_t			instance;
	uint64_t		key, value;
	int			status, reset_status = 0;

	instance = MCXNEX_DEV_INSTANCE(dev);
	state = ddi_get_soft_state(mcxnex_statep, instance);
	if (state == NULL) {
		return (ENXIO);
	}

	/*
	 * Layered driver open for the benefit of the DDI.  See the
	 * comments in mcxnex_open() for OTYP_LYR.
	 */
	if (otyp == OTYP_LYR) {
		return (0);
	}

	/*
	 * Search for "dev_t" in the "userland resources database".  As
	 * explained above in mcxnex_open(), we can't depend on using the
	 * current process ID here to do the lookup because the process
	 * that ultimately closes may not be the same one who opened
	 * (because of inheritance).
	 * So we lookup the "dev_t" (which points to the PID of the process
	 * that opened), and we remove the entry from the database (and free
	 * it up).  Then we do another query based on the PID value.  And when
	 * we find that database entry, we free it up too and then free the
	 * Mcxnex UAR page resource.
	 *
	 * Note: We use the mcxnex_umap_db_find_nolock() database access
	 * routine below (with an explicit mutex_enter of the database lock)
	 * to ensure that the multiple accesses (which attempt to remove the
	 * two database entries) can be done atomically.
	 *
	 * This works the same in both maintenance mode and HCA mode, except
	 * for the call to mcxnex_rsrc_free().  In the case of maintenance mode,
	 * this call is not needed, as it was not allocated in mcxnex_open()
	 * above.
	 */
	key = dev;
	mutex_enter(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	status = mcxnex_umap_db_find_nolock(instance, key, MLNX_UMAP_PID_RSRC,
	    &value, MCXNEX_UMAP_DB_REMOVE, &umapdb);
	if (status == DDI_SUCCESS) {
		/*
		 * If the "hdb_priv" field is non-NULL, it indicates that
		 * some "on close" handling is still necessary.  Call
		 * mcxnex_umap_db_handle_onclose_cb() to do the handling (i.e.
		 * to invoke all the registered callbacks).  Then free up
		 * the resources associated with "hdb_priv" and continue
		 * closing.
		 */
		priv = (mcxnex_umap_db_priv_t *)umapdb->hdbe_common.hdb_priv;
		if (priv != NULL) {
			reset_status = mcxnex_umap_db_handle_onclose_cb(priv);
			kmem_free(priv, sizeof (mcxnex_umap_db_priv_t));
			umapdb->hdbe_common.hdb_priv = (void *)NULL;
		}

		mcxnex_umap_db_free(umapdb);

		/*
		 * Now do another lookup using PID as the key (copy it from
		 * "value").  When this lookup is complete, the "value" field
		 * will contain the mcxnex_rsrc_t pointer for the UAR page
		 * resource.
		 */
		key = value;
		status = mcxnex_umap_db_find_nolock(instance, key,
		    MLNX_UMAP_UARPG_RSRC, &value, MCXNEX_UMAP_DB_REMOVE,
		    &umapdb);
		if (status == DDI_SUCCESS) {
			mcxnex_umap_db_free(umapdb);
			/* If in "maintenance mode", don't free the rsrc */
			if (MCXNEX_IS_OPERATIONAL(state->hs_operational_mode)) {
				rsrcp = (mcxnex_rsrc_t *)(uintptr_t)value;
				mcxnex_rsrc_free(state, &rsrcp);
			}
		}
	}
	mutex_exit(&mcxnex_userland_rsrc_db.hdl_umapdb_lock);
	return (reset_status);
}


/*
 * mcxnex_attach()
 *    Context: Only called from attach() path context
 */
static int
mcxnex_attach(dev_info_t *dip, ddi_attach_cmd_t cmd)
{
	mcxnex_state_t	*state;
	int		instance;
	int		status;

#ifdef __lock_lint
	(void) mcxnex_quiesce(dip);
#endif
	switch (cmd) {
	case DDI_ATTACH:
		instance = ddi_get_instance(dip);
		status = ddi_soft_state_zalloc(mcxnex_statep, instance);
		if (status != DDI_SUCCESS) {
			cmn_err(CE_NOTE, "%s%d: driver failed to attach: "
			    "attach_ssz_fail", ddi_driver_name(dip), instance);
			goto fail_attach_nomsg;

		}
		state = ddi_get_soft_state(mcxnex_statep, instance);
		ddi_set_driver_private(dip, state);
		ASSERT(state != NULL);

		/* initialize parent data */
		for (int i = 0; i < MCXNEX_MAX_PORTS; i++) {
			state->hs_ppd[i].cp_state = state;
			state->hs_ppd[i].cp_port = i;
		}

		/* clear the attach error buffer */
		MCXNEX_ATTACH_MSG_INIT(state->hs_attach_buf);

		/* Save away devinfo and instance before mcxnex_fm_init() */
		state->hs_dip = dip;
		state->hs_instance = instance;

		mcxnex_fm_init(state);

		/*
		 * Initialize driver and hardware.
		 *
		 * Note: If this initialization fails we may still
		 * wish to create a device node and remain operational
		 * so that firmware can be updated/flashed
		 * (i.e. "maintenance mode").  If this is the case,
		 * then "hs_operational_mode" will be equal to
		 * MCXNEX_MAINTENANCE_MODE.  We will not attempt to
		 * attach attach child nodes.
		 */
		status = mcxnex_drv_init(state, dip, instance);
		if ((status != DDI_SUCCESS) &&
		    (MCXNEX_IS_OPERATIONAL(state->hs_operational_mode))) {
			goto fail_attach;
		}

		/*
		 * Change the Mcxnex FM mode
		 */
		if ((mcxnex_get_state(state) & HCA_PIO_FM) &&
		    MCXNEX_IS_OPERATIONAL(state->hs_operational_mode)) {
			/*
			 * Now we wait for 50ms to give an opportunity
			 * to Solaris FMA so that HW errors can be notified.
			 * Then check if there are HW errors or not. If
			 * a HW error is detected, the Mcxnex attachment
			 * must be failed.
			 */
			delay(drv_usectohz(50000));
			if (mcxnex_init_failure(state)) {
				mcxnex_drv_fini(state);
				MCXNEX_WARNING(state, "unable to "
				    "attach due to a HW error");
				MCXNEX_ATTACH_MSG(state->hs_attach_buf,
				    "mcxnex_attach_failure due to a HW error");
				goto fail_attach;
			}

			/*
			 * There seems no HW errors during the attachment,
			 * so let's change the Mcxnex FM state to the
			 * ereport only mode.
			 */
			if (mcxnex_fm_ereport_init(state) != DDI_SUCCESS) {
				/* unwind the resources */
				mcxnex_drv_fini(state);
				MCXNEX_ATTACH_MSG(state->hs_attach_buf,
				    "mcxnex_attach_failure");
				goto fail_attach;
			}
		}

		/* Create the minor node for device */
		status = ddi_create_minor_node(dip, "devctl", S_IFCHR, instance,
		    DDI_PSEUDO, 0);
		if (status != DDI_SUCCESS) {
			MCXNEX_WARNING(state, "unable to create minor node");
			mcxnex_drv_fini(state);
			MCXNEX_ATTACH_MSG(state->hs_attach_buf,
			    "attach_create_mn_fail");
			goto fail_attach;
		}

