Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
		/*
		 * If we are in "maintenance mode", then we don't want to
		 * register with the IBTF.  All InfiniBand interfaces are
		 * uninitialized, and the device is only capable of handling
		 * requests to update/flash firmware (or test/debug requests).
		 */
		if (MCXNEX_IS_OPERATIONAL(state->hs_operational_mode)) {
			state->hs_ibtfpriv = dip;
			if (mcxnex_verbose)
				MCXNEX_NOTE(state, "!HCA is operational");
		}

		/* Report attach in maintenance mode, if appropriate */
		if (!(MCXNEX_IS_OPERATIONAL(state->hs_operational_mode))) {
			MCXNEX_NOTE(state, "driver attached "
			    "(maintenance mode only)");
			mcxnex_fm_ereport(state, HCA_IBA_ERR, HCA_ERR_DEGRADED);
		}

		/* Report that driver was loaded */
		ddi_report_dev(dip);

		/* Send device information to log file */
		mcxnex_device_info_report(state);

		return (DDI_SUCCESS);

	case DDI_RESUME:
		/* Add code here for DDI_RESUME XXX */
		return (DDI_FAILURE);

	default:
		return (DDI_FAILURE);
	}

fail_attach:
	MCXNEX_WARNING(state, "driver failed to attach: %s",
	    state->hs_attach_buf);
	if (mcxnex_get_state(state) & HCA_EREPORT_FM) {
		mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
	}
	mcxnex_drv_fini2(state);
	mcxnex_fm_fini(state);
	ddi_soft_state_free(mcxnex_statep, instance);

fail_attach_nomsg:
	return (DDI_FAILURE);
}


/*
 * mcxnex_detach()
 *    Context: Only called from detach() path context
 */
static int
mcxnex_detach(dev_info_t *dip, ddi_detach_cmd_t cmd)
{
	mcxnex_state_t	*state;

	state = ddi_get_driver_private(dip);
	if (state == NULL) {
		return (DDI_FAILURE);
	}

	switch (cmd) {
	case DDI_DETACH:

		/* Remove the minor node for device */
		ddi_remove_minor_node(dip, "devctl");

		/*
		 * Only call mcxnex_drv_fini() if we are in HCA mode.
		 * (Because if we are in "maintenance mode", then we never
		 * successfully finished init.)  Only report successful
		 * detach for normal HCA mode.
		 */
		if (MCXNEX_IS_OPERATIONAL(state->hs_operational_mode)) {
			/* Cleanup driver resources and shutdown hardware */
			mcxnex_drv_fini(state);
		}

		mcxnex_drv_fini2(state);
		mcxnex_fm_fini(state);
		ddi_soft_state_free(mcxnex_statep, ddi_get_instance(dip));

		return (DDI_SUCCESS);

	case DDI_SUSPEND:
		/* Add code here for DDI_SUSPEND XXX */
		return (DDI_FAILURE);

	default:
		return (DDI_FAILURE);
	}
}

/*
 * mcxnex_dma_attr_init()
 *    Context: Can be called from interrupt or base context.
 */

/* ARGSUSED */
void
mcxnex_dma_attr_init(mcxnex_state_t *state, ddi_dma_attr_t *dma_attr)
{
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*dma_attr))

	dma_attr->dma_attr_version	= DMA_ATTR_V0;
	dma_attr->dma_attr_addr_lo	= 0;
	dma_attr->dma_attr_addr_hi	= 0xFFFFFFFFFFFFFFFFull;
	dma_attr->dma_attr_count_max	= 0xFFFFFFFFFFFFFFFFull;
	dma_attr->dma_attr_align	= MCXNEX_PAGESIZE;  /* default 4K */
	dma_attr->dma_attr_burstsizes	= 0x3FF;
	dma_attr->dma_attr_minxfer	= 1;
	dma_attr->dma_attr_maxxfer	= 0xFFFFFFFFFFFFFFFFull;
	dma_attr->dma_attr_seg		= 0xFFFFFFFFFFFFFFFFull;
	dma_attr->dma_attr_sgllen	= 0x7FFFFFFF;
	dma_attr->dma_attr_granular	= 1;
	dma_attr->dma_attr_flags	= 0;
}

/*
 * mcxnex_dma_alloc()
 *    Context: Can be called from base context.
 */
int
mcxnex_dma_alloc(mcxnex_state_t *state, mcxnex_dma_info_t *dma_info,
    uint16_t opcode)
{
	ddi_dma_handle_t	dma_hdl;
	ddi_dma_attr_t		dma_attr;
	ddi_acc_handle_t	acc_hdl;
	ddi_dma_cookie_t	cookie;
	uint64_t		kaddr;
	uint64_t		real_len;
	uint_t			ccount;
	int			status;

	mcxnex_dma_attr_init(state, &dma_attr);

	/* Allocate a DMA handle */
	status = ddi_dma_alloc_handle(state->hs_dip, &dma_attr, DDI_DMA_SLEEP,
	    NULL, &dma_hdl);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "DMA alloc handle failed (status %d)",
		    status);
		return (DDI_FAILURE);
	}

	/* Allocate DMA memory */
	status = ddi_dma_mem_alloc(dma_hdl, dma_info->length,
	    &state->hs_reg_accattr, DDI_DMA_CONSISTENT, DDI_DMA_SLEEP, NULL,
	    (caddr_t *)&kaddr, (size_t *)&real_len, &acc_hdl);
	if (status != DDI_SUCCESS) {
		ddi_dma_free_handle(&dma_hdl);
		MCXNEX_WARNING(state, "DMA memory alloc failed (status %d)",
		    status);
		return (DDI_FAILURE);
	}
	bzero((caddr_t)(uintptr_t)kaddr, real_len);

	/* Bind the memory to the handle */
	status = ddi_dma_addr_bind_handle(dma_hdl, NULL,
	    (caddr_t)(uintptr_t)kaddr, (size_t)real_len, DDI_DMA_RDWR |
	    DDI_DMA_CONSISTENT, DDI_DMA_SLEEP, NULL, &cookie, &ccount);
	if (status != DDI_SUCCESS) {
		ddi_dma_mem_free(&acc_hdl);
		ddi_dma_free_handle(&dma_hdl);
		MCXNEX_WARNING(state, "DMA bind handle failed (status %d)",
		    status);
		return (DDI_FAILURE);
	}

	/* Package the mcxnex_dma_info contents and return */
	dma_info->vaddr   = kaddr;
	dma_info->dma_hdl = dma_hdl;
	dma_info->acc_hdl = acc_hdl;

	/* Pass the mapping information to the firmware */
	status = mcxnex_map_cmd_post(state, dma_info, opcode, cookie, ccount);
	if (status != DDI_SUCCESS) {
		char *s;
		mcxnex_dma_free(dma_info);
		switch (opcode) {
		case MAP_ICM:
			s = "MAP_ICM";
			break;
		case MAP_FA:
			s = "MAP_FA";
			break;
		case MAP_ICM_AUX:
			s = "MAP_ICM_AUX";
			break;
		default:
			s = "UNKNOWN";
		}
		MCXNEX_WARNING(state, "Map cmd '%s' failed, status %x",
		    s, status);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}

/*
 * mcxnex_dma_free()
 *    Context: Can be called from base context.
 */
void
mcxnex_dma_free(mcxnex_dma_info_t *info)
{
	/* Unbind the handles and free the memory */
	(void) ddi_dma_unbind_handle(info->dma_hdl);
	ddi_dma_mem_free(&info->acc_hdl);
	ddi_dma_free_handle(&info->dma_hdl);
}

/* These macros are valid for use only in mcxnex_icm_alloc/mcxnex_icm_free. */
#define	MCXNEX_ICM_ALLOC(rsrc) \
	mcxnex_icm_alloc(state, rsrc, index1, index2)
#define	MCXNEX_ICM_FREE(rsrc) \
	mcxnex_icm_free(state, rsrc, index1, index2)

/*
 * mcxnex_icm_alloc()
 *    Context: Can be called from base context.
 *
 * Only one thread can be here for a given mcxnex_rsrc_type_t "type".
 */
int
mcxnex_icm_alloc(mcxnex_state_t *state, mcxnex_rsrc_type_t type,
    uint32_t index1, uint32_t index2)
{
	mcxnex_icm_table_t	*icm;
	mcxnex_dma_info_t	*dma_info;
	uint8_t			*bitmap;
	int			status;

	icm = &state->hs_icm[type];

	switch (type) {
	case MCXNEX_QPC:
		status = MCXNEX_ICM_ALLOC(MCXNEX_CMPT_QPC);
		if (status != DDI_SUCCESS) {
			return (status);
		}
		status = MCXNEX_ICM_ALLOC(MCXNEX_RDB);
		if (status != DDI_SUCCESS) {	/* undo icm_alloc's */
			MCXNEX_ICM_FREE(MCXNEX_CMPT_QPC);
			return (status);
		}
		status = MCXNEX_ICM_ALLOC(MCXNEX_ALTC);
		if (status != DDI_SUCCESS) {	/* undo icm_alloc's */
			MCXNEX_ICM_FREE(MCXNEX_RDB);
			MCXNEX_ICM_FREE(MCXNEX_CMPT_QPC);
			return (status);
		}
		status = MCXNEX_ICM_ALLOC(MCXNEX_AUXC);
		if (status != DDI_SUCCESS) {	/* undo icm_alloc's */
			MCXNEX_ICM_FREE(MCXNEX_ALTC);
			MCXNEX_ICM_FREE(MCXNEX_RDB);
			MCXNEX_ICM_FREE(MCXNEX_CMPT_QPC);
			return (status);
		}
		break;
	case MCXNEX_SRQC:
		status = MCXNEX_ICM_ALLOC(MCXNEX_CMPT_SRQC);
		if (status != DDI_SUCCESS) {
			return (status);
		}
		break;
	case MCXNEX_CQC:
		status = MCXNEX_ICM_ALLOC(MCXNEX_CMPT_CQC);
		if (status != DDI_SUCCESS) {
			return (status);
		}
		break;
	case MCXNEX_EQC:
		status = MCXNEX_ICM_ALLOC(MCXNEX_CMPT_EQC);
		if (status != DDI_SUCCESS) {	/* undo icm_alloc's */
			return (status);
		}
		break;
	}

