Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
	/* ensure existence of bitmap and dmainfo, sets "dma_info" */
	mcxnex_bitmap(bitmap, dma_info, icm, index1);

	/* Set up the DMA handle for allocation and mapping */
	dma_info = icm->icm_dma[index1] + index2;
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*dma_info))
	dma_info->length  = icm->span << icm->log_object_size;
	dma_info->icmaddr = icm->icm_baseaddr +
	    (((index1 << icm->split_shift) +
	    (index2 << icm->span_shift)) << icm->log_object_size);

	DTRACE_PROBE6(mcxnex__alloc_icm_dma,
	    mcxnex_state_t *, state,
	    mcxnex_rsrc_type_t, type,
	    uint32_t, index1,
	    uint32_t, index2,
	    mcxnex_dma_info_t *, dma_info,
	    uint8_t *, bitmap);

	if (dma_info->length < MCXNEX_PAGESIZE)
		dma_info->length = MCXNEX_PAGESIZE;

	/* Allocate and map memory for this span */
	status = mcxnex_dma_alloc(state, dma_info, MAP_ICM);
	if (status != DDI_SUCCESS) {

		switch (type) {
		case MCXNEX_QPC:
			MCXNEX_ICM_FREE(MCXNEX_AUXC);
			MCXNEX_ICM_FREE(MCXNEX_ALTC);
			MCXNEX_ICM_FREE(MCXNEX_RDB);
			MCXNEX_ICM_FREE(MCXNEX_CMPT_QPC);
			break;
		case MCXNEX_SRQC:
			MCXNEX_ICM_FREE(MCXNEX_CMPT_SRQC);
			break;
		case MCXNEX_CQC:
			MCXNEX_ICM_FREE(MCXNEX_CMPT_CQC);
			break;
		case MCXNEX_EQC:
			MCXNEX_ICM_FREE(MCXNEX_CMPT_EQC);
			break;
		}

		return (DDI_FAILURE);
	}

	DTRACE_PROBE5(mcxnex__mapped_icm_dma,
	    mcxnex_state_t *, state,
	    mcxnex_rsrc_type_t, type,
	    uint32_t, index1,
	    uint32_t, index2,
	    mcxnex_dma_info_t *, dma_info);

	/* Set the bit for this slot in the table bitmap */
	MCXNEX_BMAP_BIT_SET(icm->icm_bitmap[index1], index2);

	return (DDI_SUCCESS);
}

/*
 * mcxnex_icm_free()
 *    Context: Can be called from base context.
 *
 * ICM resources have been successfully returned from mcxnex_icm_alloc().
 * Associated dma_info is no longer in use.  Free the ICM backing memory.
 */
void
mcxnex_icm_free(mcxnex_state_t *state, mcxnex_rsrc_type_t type,
    uint32_t index1, uint32_t index2)
{
	mcxnex_icm_table_t	*icm;
	mcxnex_dma_info_t	*dma_info;
	int			status;

	icm = &state->hs_icm[type];
	ASSERT(icm->icm_dma[index1][index2].icm_refcnt == 0);

	dma_info = icm->icm_dma[index1] + index2;

	/* The following only happens if attach() is failing. */
	if (dma_info == NULL)
		return;

	/* Unmap the ICM allocation, then free the backing DMA memory */
	status = mcxnex_unmap_icm_cmd_post(state, dma_info);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "UNMAP_ICM failure: %x", status);
	}
	mcxnex_dma_free(dma_info);

	/* Clear the bit in the ICM table bitmap */
	MCXNEX_BMAP_BIT_CLR(icm->icm_bitmap[index1], index2);

	switch (type) {
	case MCXNEX_QPC:
		MCXNEX_ICM_FREE(MCXNEX_AUXC);
		MCXNEX_ICM_FREE(MCXNEX_ALTC);
		MCXNEX_ICM_FREE(MCXNEX_RDB);
		MCXNEX_ICM_FREE(MCXNEX_CMPT_QPC);
		break;
	case MCXNEX_SRQC:
		MCXNEX_ICM_FREE(MCXNEX_CMPT_SRQC);
		break;
	case MCXNEX_CQC:
		MCXNEX_ICM_FREE(MCXNEX_CMPT_CQC);
		break;
	case MCXNEX_EQC:
		MCXNEX_ICM_FREE(MCXNEX_CMPT_EQC);
		break;

	}
}

/*
 * mcxnex_drv_init()
 *    Context: Only called from attach() path context
 */
/* ARGSUSED */
static int
mcxnex_drv_init(mcxnex_state_t *state, dev_info_t *dip, int instance)
{
	int	status;

	/*
	 * Check and set the operational mode of the device. If the driver is
	 * bound to the Mcxnex device in "maintenance mode", then this generally
	 * means that either the device has been specifically jumpered to
	 * start in this mode or the firmware boot process has failed to
	 * successfully load either the primary or the secondary firmware
	 * image.
	 */
	if (MCXNEX_IS_HCA_MODE(state->hs_dip)) {
		state->hs_operational_mode = MCXNEX_HCA_MODE;
		state->hs_cfg_profile_setting = MCXNEX_CFG_MEMFREE;

	} else if (MCXNEX_IS_MAINTENANCE_MODE(state->hs_dip)) {
		MCXNEX_FMANOTE(state, MCXNEX_FMA_MAINT);
		state->hs_operational_mode = MCXNEX_MAINTENANCE_MODE;
		state->hs_fm_degraded_reason = HCA_FW_MISC; /* not fw reason */
		return (DDI_FAILURE);

	} else {
		state->hs_operational_mode = 0;	/* invalid operational mode */
		MCXNEX_FMANOTE(state, MCXNEX_FMA_PCIID);
		MCXNEX_WARNING(state, "unexpected device type detected");
		return (DDI_FAILURE);
	}

	/*
	 * Initialize the hardware.
	 *
	 * Note:  If this routine returns an error, it is often a reasonably
	 * good indication that something Mcxnex firmware-related has caused
	 * the failure or some HW related errors have caused the failure.
	 * (also there are few possibilities that SW (e.g. SW resource
	 * shortage) can cause the failure, but the majority case is due to
	 * either a firmware related error or a HW related one) In order to
	 * give the user an opportunity (if desired) to update or reflash
	 * the Mcxnex firmware image, we set "hs_operational_mode" flag
	 * (described above) to indicate that we wish to enter maintenance
	 * mode in case of the firmware-related issue.
	 */
	status = mcxnex_hw_init(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "error during attach: %s",
		    state->hs_attach_buf);
		return (DDI_FAILURE);
	}

	/*
	 * Now that the ISR has been setup, arm all the EQs for event
	 * generation.
	 */

	status = mcxnex_eq_arm_all(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "EQ Arm All failed");
		mcxnex_hw_fini(state, MCXNEX_DRV_CLEANUP_ALL);
		return (DDI_FAILURE);
	}

	/* test interrupts and event queues */
	status = mcxnex_nop_post(state, 0x0, 0x0);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "Interrupts/EQs failed");
		mcxnex_hw_fini(state, MCXNEX_DRV_CLEANUP_ALL);
		return (DDI_FAILURE);
	}

	/* Initialize softstate */
	status = mcxnex_soft_state_init(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "Failed to init soft state");
		mcxnex_hw_fini(state, MCXNEX_DRV_CLEANUP_ALL);
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_drv_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
static void
mcxnex_drv_fini(mcxnex_state_t *state)
{
	/* Cleanup Mcxnex softstate */
	mcxnex_soft_state_fini(state);

	/* Cleanup Mcxnex resources and shutdown hardware */
	mcxnex_hw_fini(state, MCXNEX_DRV_CLEANUP_ALL);
}


