Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL1;
	/*
	 * We defer UAR-BAR mapping until later.  Need to know if
	 * blueflame mapping is to be done, and don't know that until after
	 * we get the dev_caps, so do it right after that
	 */

	/*
	 * There is a third BAR defined for Mcxnex - it is for MSIX
	 *
	 * Will need to explore it's possible need/use w/ Mellanox
	 * [es] Temporary mapping maybe
	 */

#ifdef MCXNEX_SUPPORTS_MSIX_BAR
	status = ddi_regs_map_setup(state->hs_dip, MCXNEX_MSIX_BAR,
	    &state->hs_reg_msi_baseaddr, 0, 0, &state->hs_reg_accattr,
	    &state->hs_reg_msihdl);
	if (status != DDI_SUCCESS) {
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_MSIX_BAR_regmap_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
#endif

	cleanup = MCXNEX_DRV_CLEANUP_LEVEL2;

	/*
	 * Save interesting registers away. The offsets of the first two
	 * here (HCR and sw_reset) are detailed in the PRM, the others are
	 * derived from values in the QUERY_FW output, so we'll save them
	 * off later.
	 */
	/* Host Command Register (HCR) */
	state->hs_cmd_regs.hcr = (mcxnex_hw_hcr_t *)
	    ((uintptr_t)state->hs_reg_cmd_baseaddr + MCXNEX_CMD_HCR_OFFSET);
	state->hs_cmd_toggle = 0;	/* initialize it for use */

	/* Software Reset register (sw_reset) and semaphore */
	state->hs_cmd_regs.sw_reset = (uint32_t *)
	    ((uintptr_t)state->hs_reg_cmd_baseaddr +
	    MCXNEX_CMD_SW_RESET_OFFSET);
	state->hs_cmd_regs.sw_semaphore = (uint32_t *)
	    ((uintptr_t)state->hs_reg_cmd_baseaddr +
	    MCXNEX_CMD_SW_SEMAPHORE_OFFSET);

	/* Retrieve PCI device, vendor and rev IDs */
	state->hs_vendor_id	 = MCXNEX_GET_VENDOR_ID(state->hs_dip);
	state->hs_device_id	 = MCXNEX_GET_DEVICE_ID(state->hs_dip);
	state->hs_revision_id	 = MCXNEX_GET_REVISION_ID(state->hs_dip);

	/* make sure init'd before we start filling things in */
	bzero(&state->hs_hcaparams, sizeof (struct mcxnex_hw_initqueryhca_s));

	/* Initialize the Phase1 configuration profile */
	status = mcxnex_cfg_profile_init_phase1(state);
	if (status != DDI_SUCCESS) {
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_cfginit1_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL3;

	/* Do a software reset of the adapter to ensure proper state */
	status = mcxnex_sw_reset(state);
	if (status != MCXNEX_CMD_SUCCESS) {
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_sw_reset_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	/* Initialize mailboxes */
	status = mcxnex_rsrc_init_phase1(state);
	if (status != DDI_SUCCESS) {
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_rsrcinit1_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL4;

	/* Post QUERY_FW */
	status = mcxnex_cmn_query_cmd_post(state, QUERY_FW, 0, 0, &state->hs_fw,
	    sizeof (state->hs_fw), DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "QUERY_FW failed: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_query_fw_cmd_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	/* Validate what/that MCXNEX FW version is appropriate */

	status = mcxnex_fw_version_check(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_FMANOTE(state, MCXNEX_FMA_FWVER);
		if (state->hs_operational_mode == MCXNEX_HCA_MODE) {
			MCXNEX_NOTE(state, "Unsupported firmware version: "
			    "expected: %04d.%04d.%04d, "
			    "actual: %04d.%04d.%04d",
			    MCXNEX_FW_VER_MAJOR,
			    MCXNEX_FW_VER_MINOR,
			    MCXNEX_FW_VER_SUBMINOR,
			    state->hs_fw.fw_rev_major,
			    state->hs_fw.fw_rev_minor,
			    state->hs_fw.fw_rev_subminor);
		} else {
			MCXNEX_NOTE(state, "Unsupported FW version: "
			    "%04d.%04d.%04d",
			    state->hs_fw.fw_rev_major,
			    state->hs_fw.fw_rev_minor,
			    state->hs_fw.fw_rev_subminor);
		}
		state->hs_operational_mode = MCXNEX_MAINTENANCE_MODE;
		state->hs_fm_degraded_reason = HCA_FW_MISMATCH;
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_checkfwver_fail");
		/* This case is the degraded one */
		return (MCXNEX_CMD_BAD_NVMEM);
	}

	if (MCXNEX_FW_VER_NUM(state) > MCXNEX_FW_VER_VLAN_STRIP_CAP)
		state->hs_vlan_strip_off_cap = 1;

	/*
	 * Save off the rest of the interesting registers that we'll be using.
	 * Setup the offsets for the other registers.
	 */

	/*
	 * Mcxnex does the intr_offset from the BAR - technically should get the
	 * BAR info from the response, but PRM says it's from BAR0-1, which is
	 * for us the CMD BAR
	 */

	clr_intr_offset	 = state->hs_fw.clr_intr_offs & MCXNEX_CMD_OFFSET_MASK;

	/* Save Clear Interrupt address */
	state->hs_cmd_regs.clr_intr = (uint64_t *)
	    (uintptr_t)(state->hs_reg_cmd_baseaddr + clr_intr_offset);

	/*
	 * Set the error buffer also into the structure - used in mcxnex_event.c
	 * to check for internal error on the HCA, not reported in eqe or
	 * (necessarily) by interrupt
	 */
	state->hs_cmd_regs.fw_err_buf = (uint32_t *)(uintptr_t)
	    (state->hs_reg_cmd_baseaddr + state->hs_fw.error_buf_addr);

	/*
	 * Invoke a polling thread to check the error buffer periodically.
	 */
	if (!mcxnex_no_inter_err_chk) {
		state->hs_fm_poll_thread = ddi_periodic_add(
		    mcxnex_inter_err_chk, (void *)state, FM_POLL_INTERVAL,
		    DDI_IPL_0);
	}

	cleanup = MCXNEX_DRV_CLEANUP_LEVEL5;

	/*
	 * Allocate, map, and run the HCA Firmware.
	 */

	/* Allocate memory for the firmware to load into and map it */

	/* get next higher power of 2 */
	fw_size = 1 << highbit(state->hs_fw.fw_pages);
	state->hs_fw_dma.length = fw_size << MCXNEX_PAGESHIFT;
	status = mcxnex_dma_alloc(state, &state->hs_fw_dma, MAP_FA);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "FW alloc failed");
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_dma_alloc_fw_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	cleanup = MCXNEX_DRV_CLEANUP_LEVEL6;

	/* Invoke the RUN_FW cmd to run the firmware */
	status = mcxnex_run_fw_cmd_post(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "RUN_FW command failed: %x", status);
		if (status == MCXNEX_CMD_BAD_NVMEM) {
			state->hs_operational_mode = MCXNEX_MAINTENANCE_MODE;
			state->hs_fm_degraded_reason = HCA_FW_CORRUPT;
		}
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf, "hw_init_run_fw_fail");
		/*
		 * If the status is MCXNEX_CMD_BAD_NVMEM, it's likely the
		 * firmware is corrupted, so the mode falls into the
		 * maintenance mode.
		 */
		return (status == MCXNEX_CMD_BAD_NVMEM ? MCXNEX_CMD_BAD_NVMEM :
		    DDI_FAILURE);
	}


