Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
	/*
	 * QUERY DEVICE LIMITS/CAPABILITIES
	 * NOTE - in Mcxnex, the command is changed to QUERY_DEV_CAP,
	 * but for familiarity we have kept the structure name the
	 * same as Tavor/Arbel
	 */

	status = mcxnex_cmn_query_cmd_post(state, QUERY_DEV_CAP, 0, 0,
	    &state->hs_devlim, sizeof (state->hs_devlim), DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "QUERY_DEV_CAP failed: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf, "hw_init_devcap_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	state->hs_devlim.num_rsvd_eq = max(state->hs_devlim.num_rsvd_eq,
	    (4 * state->hs_devlim.num_rsvd_uar));	/* lesser of resvd's */

	/* now we have enough info to map in the UAR BAR */
	/*
	 * First, we figure out how to map the BAR for UAR - use only half if
	 * BlueFlame is enabled - in that case the mapped length is 1/2 the
	 * log_max_uar_sz (max__uar - 1) * 1MB ( +20).
	 */

	if (state->hs_devlim.blu_flm) {		/* Blue Flame Enabled */
		offset = (uint64_t)1 << (state->hs_devlim.log_max_uar_sz + 20);
	} else {
		offset = 0;	/* a zero length means map the whole thing */
	}
	status = mcxnex_regs_map_setup(state, MCXNEX_UAR_BAR,
	    &state->hs_reg_uar_baseaddr, 0, offset, &state->hs_fm_accattr,
	    &state->hs_fm_uarhdl);
	if (status != DDI_SUCCESS) {
		MCXNEX_ATTACH_MSG(state->hs_attach_buf, "UAR BAR mapping");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	/* and if BlueFlame is enabled, map the other half there */
	if (state->hs_devlim.blu_flm) {		/* Blue Flame Enabled */
		offset = (uint64_t)1 << (state->hs_devlim.log_max_uar_sz + 20);
		status = ddi_regs_map_setup(state->hs_dip, MCXNEX_UAR_BAR,
		    &state->hs_reg_bf_baseaddr, offset, offset,
		    &state->hs_reg_accattr, &state->hs_reg_bfhdl);
		if (status != DDI_SUCCESS) {
			MCXNEX_ATTACH_MSG(state->hs_attach_buf,
			    "BlueFlame BAR mapping");
			/* This case is not the degraded one */
			return (DDI_FAILURE);
		}
		/* This will be used in hw_fini if we fail to init. */
		state->hs_bf_offset = offset;
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL7;

	/* Mcxnex has a couple of things needed for phase 2 in query port */

	status = mcxnex_cmn_query_cmd_post(state, QUERY_PORT, 0, 0x01,
	    &state->hs_queryport, sizeof (state->hs_queryport), DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "QUERY_PORT failed: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_queryport_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	/* Initialize the Phase2 Mcxnex configuration profile */
	status = mcxnex_cfg_profile_init_phase2(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "CFG phase 2 failed: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_cfginit2_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	/* Determine and set the ICM size */
	state->hs_icm_sz = mcxnex_size_icm(state);
	status		 = mcxnex_set_icm_size_cmd_post(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "SET_ICM_SIZE failed: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_seticmsz_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	/* alloc icm aux physical memory and map it */

	state->hs_icma_dma.length = 1 << highbit(state->hs_icma_sz);

	status = mcxnex_dma_alloc(state, &state->hs_icma_dma, MAP_ICM_AUX);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to alloc (0x%llx) bytes for ICMA",
		    (longlong_t)state->hs_icma_dma.length);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_dma_alloc_icm_aux_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL8;

	cleanup = MCXNEX_DRV_CLEANUP_LEVEL9;

	/* Allocate an array of structures to house the ICM tables */
	state->hs_icm = kmem_zalloc(MCXNEX_NUM_ICM_RESOURCES *
	    sizeof (mcxnex_icm_table_t), KM_SLEEP);

	/* Set up the ICM address space and the INIT_HCA command input */
	status = mcxnex_icm_config_setup(state, &state->hs_hcaparams);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "ICM configuration failed, %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_icm_config_setup_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL10;

	/* Initialize the adapter with the INIT_HCA cmd */
	status = mcxnex_init_hca_cmd_post(state, &state->hs_hcaparams,
	    DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "INIT_HCA failed: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf, "hw_init_hca_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL11;

	/* Enter the second phase of init for Mcxnex configuration/resources */
	status = mcxnex_rsrc_init_phase2(state);
	if (status != DDI_SUCCESS) {
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_rsrcinit2_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL12;

	/* Query the adapter via QUERY_ADAPTER */
	status = mcxnex_cmn_query_cmd_post(state, QUERY_ADAPTER, 0, 0,
	    &state->hs_adapter, sizeof (state->hs_adapter), DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "QUERY_ADAPTER failed: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_query_adapter_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	/* Allocate protection domain (PD) for Mcxnex internal use */
	status = mcxnex_pd_alloc(state, &state->hs_pdhdl_internal, DDI_SLEEP);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state,
		    "failed to alloc internal PD: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_internal_pd_alloc_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL13;

