Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
	/* Setup UAR page for kernel use */
	status = mcxnex_internal_uarpg_init(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state,
		    "failed to setup internal UAR: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_internal_uarpg_alloc_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL14;

	/* Query and initialize the Mcxnex interrupt/MSI information */
	status = mcxnex_intr_or_msi_init(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to setup INTR/MSI: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_intr_or_msi_init_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL15;

	status = mcxnex_isr_init(state);	/* set up the isr */
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to init isr: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_isrinit_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL16;

	/* Setup the event queues */
	status = mcxnex_eq_init_all(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to init EQs: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_eqinitall_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL17;



	/* Reserve contexts for QP0 and QP1 */
	status = mcxnex_special_qp_contexts_reserve(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to init special QPs: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_rsrv_sqp_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL18;

	/* Initialize for multicast group handling */
	status = mcxnex_mcg_init(state);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to init multicast: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_mcg_init_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}
	cleanup = MCXNEX_DRV_CLEANUP_LEVEL19;

	/* Determine NodeGUID and SystemImageGUID */
	status = mcxnex_getnodeinfo_cmd_post(state, DDI_NOSLEEP, &nodeinfo);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "GetNodeInfo failed: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_hca_port_init_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	/* Get NodeDescription */
	status = mcxnex_getnodedesc_cmd_post(state, DDI_NOSLEEP,
	    (sm_nodedesc_t *)&state->hs_nodedesc);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "GetNodeDesc failed: %x", status);
		mcxnex_hw_fini(state, cleanup);
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "hw_init_getnodedesc_cmd_fail");
		/* This case is not the degraded one */
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_hw_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
static void
mcxnex_hw_fini(mcxnex_state_t *state, mcxnex_drv_cleanup_level_t cleanup)
{
	uint_t		num_ports;
	int		i, status;


	/*
	 * JBDB - We might not want to run these returns in all cases of
	 * Bad News. We should still attempt to free all of the DMA memory
	 * resources...  This needs to be worked last, after all allocations
	 * are implemented. For now, and possibly for later, this works.
	 */

	switch (cleanup) {
	/*
	 * If we add more driver initialization steps that should be cleaned
	 * up here, we need to ensure that MCXNEX_DRV_CLEANUP_ALL is still the
	 * first entry (i.e. corresponds to the last init step).
	 */
	case MCXNEX_DRV_CLEANUP_ALL:
		/* Shutdown the Mcxnex IB port(s) */
		num_ports = state->hs_cfg_profile->cp_num_ports;
		(void) mcxnex_hca_ports_shutdown(state, num_ports);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL19:
		/* Teardown resources used for multicast group handling */
		mcxnex_mcg_fini(state);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL18:
		/* Unreserve the special QP contexts */
		mcxnex_special_qp_contexts_unreserve(state);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL17:
		/*
		 * Attempt to teardown all event queues (EQ).  If we fail
		 * here then print a warning message and return.  Something
		 * (either in HW or SW) has gone seriously wrong.
		 */
		status = mcxnex_eq_fini_all(state);
		if (status != DDI_SUCCESS) {
			MCXNEX_WARNING(state, "failed to teardown EQs");
			return;
		}
		/* FALLTHROUGH */
	case MCXNEX_DRV_CLEANUP_LEVEL16:
		/* Teardown Mcxnex interrupts */
		mcxnex_isr_fini(state);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL15:
		status = mcxnex_intr_or_msi_fini(state);
		if (status != DDI_SUCCESS) {
			MCXNEX_WARNING(state, "failed to free intr/MSI");
			return;
		}
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL14:
		/* Free the resources for the Mcxnex internal UAR pages */
		mcxnex_internal_uarpg_fini(state);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL13:
		/*
		 * Free the PD that was used internally by Mcxnex software.  If
		 * we fail here then print a warning and return.  Something
		 * (probably software-related, but perhaps HW) has gone wrong.
		 */
		status = mcxnex_pd_free(state, &state->hs_pdhdl_internal);
		if (status != DDI_SUCCESS) {
			MCXNEX_WARNING(state, "failed to free internal PD");
			return;
		}
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL12:
		/* Cleanup all the phase2 resources first */
		mcxnex_rsrc_fini(state, MCXNEX_RSRC_CLEANUP_ALL);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL11:
		/* LEVEL11 is after INIT_HCA */
		/* FALLTHROUGH */


	case MCXNEX_DRV_CLEANUP_LEVEL10:
		/*
		 * Unmap the ICM memory area with UNMAP_ICM command.
		 */
		status = mcxnex_unmap_icm_cmd_post(state, NULL);
		if (status != DDI_SUCCESS) {
			MCXNEX_WARNING(state, "failed to unmap ICM");
		}

		/* Free the initial ICM DMA handles */
		mcxnex_icm_dma_fini(state);

		/* Free the ICM table structures */
		mcxnex_icm_tables_fini(state);

