Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
		/* Free the ICM table handles */
		kmem_free(state->hs_icm, MCXNEX_NUM_ICM_RESOURCES *
		    sizeof (mcxnex_icm_table_t));

		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL9:
		/*
		 * Unmap the ICM Aux memory area with UNMAP_ICM_AUX command.
		 */
		status = mcxnex_unmap_icm_aux_cmd_post(state);
		if (status != MCXNEX_CMD_SUCCESS) {
			MCXNEX_WARNING(state, "failed to unmap ICMA");
		}
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL8:
		/*
		 * Deallocate ICM Aux DMA memory.
		 */
		mcxnex_dma_free(&state->hs_icma_dma);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL7:
		if (state->hs_fm_uarhdl) {
			mcxnex_regs_map_free(state, &state->hs_fm_uarhdl);
			state->hs_fm_uarhdl = NULL;
		}

		if (state->hs_reg_uarhdl) {
			ddi_regs_map_free(&state->hs_reg_uarhdl);
			state->hs_reg_uarhdl = NULL;
		}

		if (state->hs_bf_offset != 0 && state->hs_reg_bfhdl) {
			ddi_regs_map_free(&state->hs_reg_bfhdl);
			state->hs_reg_bfhdl = NULL;
		}

		for (i = 0; i < MCXNEX_MAX_PORTS; i++) {
			if (state->hs_pkey[i]) {
				kmem_free(state->hs_pkey[i], (1 <<
				    state->hs_cfg_profile->cp_log_max_pkeytbl) *
				    sizeof (ib_pkey_t));
				state->hs_pkey[i] = NULL;
			}
			if (state->hs_guid[i]) {
				kmem_free(state->hs_guid[i], (1 <<
				    state->hs_cfg_profile->cp_log_max_gidtbl) *
				    sizeof (ib_guid_t));
				state->hs_guid[i] = NULL;
			}
		}
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL6:
		/*
		 * Unmap the firmware memory area with UNMAP_FA command.
		 */
		status = mcxnex_unmap_fa_cmd_post(state);

		if (status != MCXNEX_CMD_SUCCESS) {
			MCXNEX_WARNING(state, "failed to unmap FW");
		}

		/*
		 * Deallocate firmware DMA memory.
		 */
		mcxnex_dma_free(&state->hs_fw_dma);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL5:
		/* stop the poll thread */
		if (state->hs_fm_poll_thread) {
			ddi_periodic_delete(state->hs_fm_poll_thread);
			state->hs_fm_poll_thread = NULL;
		}
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL4:
		/* Then cleanup the phase1 resources */
		mcxnex_rsrc_fini(state, MCXNEX_RSRC_CLEANUP_PHASE1_COMPLETE);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL3:
		/* Teardown any resources allocated for the config profile */
		mcxnex_cfg_profile_fini(state);
		/* FALLTHROUGH */

	case MCXNEX_DRV_CLEANUP_LEVEL2:
#ifdef MCXNEX_SUPPORTS_MSIX_BAR
		/*
		 * unmap 3rd BAR, MSIX BAR
		 */
		if (state->hs_reg_msihdl) {
			ddi_regs_map_free(&state->hs_reg_msihdl);
			state->hs_reg_msihdl = NULL;
		}
		/* FALLTHROUGH */
#endif
	case MCXNEX_DRV_CLEANUP_LEVEL1:
	case MCXNEX_DRV_CLEANUP_LEVEL0:
		/*
		 * LEVEL1 and LEVEL0 resources are freed in
		 * mcxnex_drv_fini2().
		 */
		break;

	default:
		MCXNEX_WARNING(state, "unexpected driver cleanup level");
		return;
	}
}


/*
 * mcxnex_soft_state_init()
 *    Context: Only called from attach() path context
 */
static int
mcxnex_soft_state_init(mcxnex_state_t *state)
{
	ibt_hca_attr_t		*hca_attr;
	uint64_t		maxval, val;
	ibt_hca_flags_t		caps = IBT_HCA_NO_FLAGS;
	ibt_hca_flags2_t	caps2 = IBT_HCA2_NO_FLAGS;
	int			status;
	int			max_send_wqe_bytes;
	int			max_recv_wqe_bytes;

	/*
	 * The ibc_hca_info_t struct is passed to the IBTF.  This is the
	 * routine where we initialize it.  Many of the init values come from
	 * either configuration variables or successful queries of the Mcxnex
	 * hardware abilities
	 */
	state->hs_ibtfinfo.hca_ci_vers	= IBCI_V3;
	state->hs_ibtfinfo.hca_handle	= (ibc_hca_hdl_t)state;

	hca_attr = kmem_zalloc(sizeof (ibt_hca_attr_t), KM_SLEEP);
	state->hs_ibtfinfo.hca_attr = hca_attr;

	/* hca_attr->hca_dip = state->hs_dip; */
	hca_attr->hca_fw_major_version = state->hs_fw.fw_rev_major;
	hca_attr->hca_fw_minor_version = state->hs_fw.fw_rev_minor;
	hca_attr->hca_fw_micro_version = state->hs_fw.fw_rev_subminor;

	/* CQ interrupt moderation maximums - each limited to 16 bits */
	hca_attr->hca_max_cq_mod_count = 0xFFFF;
	hca_attr->hca_max_cq_mod_usec = 0xFFFF;

	/* CQ relocation to other EQs - change when multiple MSI-Xs are used */
	hca_attr->hca_max_cq_handlers = 1;

	/*
	 * Determine HCA capabilities:
	 * No default support for IBT_HCA_RD, IBT_HCA_RAW_MULTICAST,
	 *    IBT_HCA_ATOMICS_GLOBAL, IBT_HCA_RESIZE_CHAN, IBT_HCA_INIT_TYPE,
	 *    or IBT_HCA_SHUTDOWN_PORT
	 * But IBT_HCA_AH_PORT_CHECK, IBT_HCA_SQD_RTS_PORT, IBT_HCA_SI_GUID,
	 *    IBT_HCA_RNR_NAK, IBT_HCA_CURRENT_QP_STATE, IBT_HCA_PORT_UP,
	 *    IBT_HCA_SRQ, IBT_HCA_RESIZE_SRQ and IBT_HCA_FMR are always
	 *    supported
	 * All other features are conditionally supported, depending on the
	 *    status return by the Mcxnex HCA in QUERY_DEV_LIM.
	 */
	if (state->hs_devlim.ud_multi) {
		caps |= IBT_HCA_UD_MULTICAST;
	}
	if (state->hs_devlim.atomic) {
		caps |= IBT_HCA_ATOMICS_HCA;
	}
	if (state->hs_devlim.apm) {
		caps |= IBT_HCA_AUTO_PATH_MIG;
	}
	if (state->hs_devlim.pkey_v) {
		caps |= IBT_HCA_PKEY_CNTR;
	}
	if (state->hs_devlim.qkey_v) {
		caps |= IBT_HCA_QKEY_CNTR;
	}
	if (state->hs_devlim.ipoib_cksm) {
		caps |= IBT_HCA_CKSUM_FULL;
		caps2 |= IBT_HCA2_IP_CLASS;
	}
	if (state->hs_devlim.mod_wr_srq) {
		caps |= IBT_HCA_RESIZE_SRQ;
	}
	if (state->hs_devlim.lif) {
		caps |= IBT_HCA_LOCAL_INVAL_FENCE;
	}
	if (state->hs_devlim.reserved_lkey) {
		caps2 |= IBT_HCA2_RES_LKEY;
		hca_attr->hca_reserved_lkey = state->hs_devlim.rsv_lkey;
	}
	if (state->hs_devlim.local_inv && state->hs_devlim.remote_inv &&
	    state->hs_devlim.fast_reg_wr) {	/* fw needs to be >= 2.6.636 */
		if (state->hs_fw.fw_rev_major > 2)
			caps2 |= IBT_HCA2_MEM_MGT_EXT;
		else if (state->hs_fw.fw_rev_major == 2)
			if (state->hs_fw.fw_rev_minor > 6)
				caps2 |= IBT_HCA2_MEM_MGT_EXT;
			else if (state->hs_fw.fw_rev_minor == 6)
				if (state->hs_fw.fw_rev_subminor >= 636)
					caps2 |= IBT_HCA2_MEM_MGT_EXT;
	}
	if (state->hs_devlim.mps) {
		caps |= IBT_HCA_ZERO_BASED_VA;
	}
	if (state->hs_devlim.zb) {
		caps |= IBT_HCA_MULT_PAGE_SZ_MR;
	}
	caps |= (IBT_HCA_AH_PORT_CHECK | IBT_HCA_SQD_SQD_PORT |
	    IBT_HCA_SI_GUID | IBT_HCA_RNR_NAK | IBT_HCA_CURRENT_QP_STATE |
	    IBT_HCA_PORT_UP | IBT_HCA_RC_SRQ | IBT_HCA_UD_SRQ | IBT_HCA_FMR);

