Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
	/*
	 * Determine maximum number of raw IPv6 and Ether QPs.  Set to 0
	 * because neither type of raw QP is supported
	 */
	hca_attr->hca_max_ipv6_qp  = 0;
	hca_attr->hca_max_ether_qp = 0;

	/* Determine max number of MCGs and max QP-per-MCG */
	val = ((uint64_t)1 << state->hs_cfg_profile->cp_log_num_qp);
	hca_attr->hca_max_mcg_qps   = (uint_t)val;
	val = ((uint64_t)1 << state->hs_cfg_profile->cp_log_num_mcg);
	hca_attr->hca_max_mcg	    = (uint_t)val;
	val = state->hs_cfg_profile->cp_num_qp_per_mcg;
	hca_attr->hca_max_qp_per_mcg = (uint_t)val;

	/* Determine max number partitions (i.e. PKeys) */
	maxval	= ((uint64_t)state->hs_cfg_profile->cp_num_ports <<
	    state->hs_queryport.log_max_pkey);
	val	= ((uint64_t)state->hs_cfg_profile->cp_num_ports <<
	    state->hs_cfg_profile->cp_log_max_pkeytbl);

	if (val > maxval) {
		kmem_free(hca_attr, sizeof (ibt_hca_attr_t));
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "soft_state_init_toomanypkey_fail");
		return (DDI_FAILURE);
	}
	hca_attr->hca_max_partitions = (uint16_t)val;

	/* Determine number of ports */
	maxval = state->hs_devlim.num_ports;
	val = state->hs_cfg_profile->cp_num_ports;
	if ((val > maxval) || (val == 0)) {
		kmem_free(hca_attr, sizeof (ibt_hca_attr_t));
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "soft_state_init_toomanyports_fail");
		return (DDI_FAILURE);
	}
	hca_attr->hca_nports = (uint8_t)val;

	/* Copy NodeGUID and SystemImageGUID from softstate */
	hca_attr->hca_node_guid = state->hs_nodeguid;
	hca_attr->hca_si_guid	= state->hs_sysimgguid;

	/*
	 * Determine local ACK delay.  Use the value suggested by the Mcxnex
	 * hardware (from the QUERY_DEV_CAP command)
	 */
	hca_attr->hca_local_ack_delay = state->hs_devlim.ca_ack_delay;

	/* Determine max SGID table and PKey table sizes */
	val	= ((uint64_t)1 << state->hs_cfg_profile->cp_log_max_gidtbl);
	hca_attr->hca_max_port_sgid_tbl_sz = (uint_t)val;
	val	= ((uint64_t)1 << state->hs_cfg_profile->cp_log_max_pkeytbl);
	hca_attr->hca_max_port_pkey_tbl_sz = (uint16_t)val;

	/* Determine max number of PDs */
	maxval	= ((uint64_t)1 << state->hs_devlim.log_max_pd);
	val	= ((uint64_t)1 << state->hs_cfg_profile->cp_log_num_pd);
	if (val > maxval) {
		kmem_free(hca_attr, sizeof (ibt_hca_attr_t));
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "soft_state_init_toomanypd_fail");
		return (DDI_FAILURE);
	}
	hca_attr->hca_max_pd = (uint_t)val;

	/* Determine max number of Address Handles (NOT IN ARBEL or MCXNEX) */
	hca_attr->hca_max_ah = 0;

	/* No RDDs or EECs (since Reliable Datagram is not supported) */
	hca_attr->hca_max_rdd = 0;
	hca_attr->hca_max_eec = 0;

	/* Initialize lock for reserved UAR page access */
	mutex_init(&state->hs_uar_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	/* Initialize the flash fields */
	state->hs_fw_flashstarted = 0;
	mutex_init(&state->hs_fw_flashlock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	/* Initialize the lock for the info ioctl */
	mutex_init(&state->hs_info_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	/* Initialize the AVL tree for QP number support */
	mcxnex_qpn_avl_init(state);

	/* Initialize the kstat info structure */
	status = mcxnex_kstat_init(state);
	if (status != DDI_SUCCESS) {
		mcxnex_qpn_avl_fini(state);
		mutex_destroy(&state->hs_info_lock);
		mutex_destroy(&state->hs_fw_flashlock);
		mutex_destroy(&state->hs_uar_lock);
		kmem_free(hca_attr, sizeof (ibt_hca_attr_t));
		MCXNEX_ATTACH_MSG(state->hs_attach_buf,
		    "soft_state_init_kstatinit_fail");
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_soft_state_fini()
 *    Context: Called only from detach() path context
 */
static void
mcxnex_soft_state_fini(mcxnex_state_t *state)
{

	/* Teardown the kstat info */
	mcxnex_kstat_fini(state);

	/* Teardown the AVL tree for QP number support */
	mcxnex_qpn_avl_fini(state);

	/* Free up info ioctl mutex */
	mutex_destroy(&state->hs_info_lock);

	/* Free up flash mutex */
	mutex_destroy(&state->hs_fw_flashlock);

	/* Free up the UAR page access mutex */
	mutex_destroy(&state->hs_uar_lock);

	/* Free up the hca_attr struct */
	kmem_free(state->hs_ibtfinfo.hca_attr, sizeof (ibt_hca_attr_t));

}

/*
 * mcxnex_icm_config_setup()
 *    Context: Only called from attach() path context
 */
static int
mcxnex_icm_config_setup(mcxnex_state_t *state,
    mcxnex_hw_initqueryhca_t *inithca)
{
	mcxnex_hw_querydevlim_t	*devlim;
	mcxnex_cfg_profile_t	*cfg;
	mcxnex_icm_table_t	*icm_p[MCXNEX_NUM_ICM_RESOURCES];
	mcxnex_icm_table_t	*icm;
	mcxnex_icm_table_t	*tmp;
	uint64_t		icm_addr;
	uint64_t		icm_size;
	int			status, i, j;


	/* Bring in local devlims, cfg_profile and hs_icm table list */
	devlim = &state->hs_devlim;
	cfg = state->hs_cfg_profile;
	icm = state->hs_icm;

	/*
	 * Assign each ICM table's entry size from data in the devlims,
	 * except for RDB and MCG sizes, which are not returned in devlims
	 * but do have a fixed size, and the UAR context entry size, which
	 * we determine. For this, we use the "cp_num_pgs_per_uce" value
	 * from our hs_cfg_profile.
	 */
	icm[MCXNEX_CMPT].object_size	= devlim->cmpt_entry_sz;
	icm[MCXNEX_CMPT_QPC].object_size	= devlim->cmpt_entry_sz;
	icm[MCXNEX_CMPT_SRQC].object_size	= devlim->cmpt_entry_sz;
	icm[MCXNEX_CMPT_CQC].object_size	= devlim->cmpt_entry_sz;
	icm[MCXNEX_CMPT_EQC].object_size	= devlim->cmpt_entry_sz;
	icm[MCXNEX_MTT].object_size	= devlim->mtt_entry_sz;
	icm[MCXNEX_DMPT].object_size	= devlim->dmpt_entry_sz;
	icm[MCXNEX_QPC].object_size	= devlim->qpc_entry_sz;
	icm[MCXNEX_CQC].object_size	= devlim->cqc_entry_sz;
	icm[MCXNEX_SRQC].object_size	= devlim->srq_entry_sz;
	icm[MCXNEX_EQC].object_size	= devlim->eqc_entry_sz;
	icm[MCXNEX_RDB].object_size	= devlim->rdmardc_entry_sz *
	    cfg->cp_hca_max_rdma_in_qp;
	icm[MCXNEX_MCG].object_size	= MCXNEX_MCGMEM_SZ(state);
	icm[MCXNEX_ALTC].object_size	= devlim->altc_entry_sz;
	icm[MCXNEX_AUXC].object_size	= devlim->aux_entry_sz;

	/* Assign each ICM table's log2 number of entries */
	icm[MCXNEX_CMPT].log_num_entries = cfg->cp_log_num_cmpt;
	icm[MCXNEX_CMPT_QPC].log_num_entries = cfg->cp_log_num_qp;
	icm[MCXNEX_CMPT_SRQC].log_num_entries = cfg->cp_log_num_srq;
	icm[MCXNEX_CMPT_CQC].log_num_entries = cfg->cp_log_num_cq;
	icm[MCXNEX_CMPT_EQC].log_num_entries = MCXNEX_NUM_EQ_SHIFT;
	icm[MCXNEX_MTT].log_num_entries	= cfg->cp_log_num_mtt;
	icm[MCXNEX_DMPT].log_num_entries = cfg->cp_log_num_dmpt;
	icm[MCXNEX_QPC].log_num_entries	= cfg->cp_log_num_qp;
	icm[MCXNEX_SRQC].log_num_entries = cfg->cp_log_num_srq;
	icm[MCXNEX_CQC].log_num_entries	= cfg->cp_log_num_cq;
	icm[MCXNEX_EQC].log_num_entries	= MCXNEX_NUM_EQ_SHIFT;
	icm[MCXNEX_RDB].log_num_entries	= cfg->cp_log_num_qp;
	icm[MCXNEX_MCG].log_num_entries	= cfg->cp_log_num_mcg;
	icm[MCXNEX_ALTC].log_num_entries = cfg->cp_log_num_qp;
	icm[MCXNEX_AUXC].log_num_entries = cfg->cp_log_num_qp;

	/* Initialize the ICM tables */
	mcxnex_icm_tables_init(state);

