Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
		}
	}

}

/*
 * mcxnex_icm_tables_init()
 *    Context: Only called from attach() path context
 *
 * Dynamic ICM breaks the various ICM tables into "span_size" chunks
 * to enable allocation of backing memory on demand.  Arbel used a
 * fixed size ARBEL_ICM_SPAN_SIZE (initially was 512KB) as the
 * span_size for all ICM chunks.  Mcxnex has other considerations,
 * so the span_size used differs from Arbel.
 *
 * The basic considerations for why Mcxnex differs are:
 *
 *	1) ICM memory is in units of MCXNEX pages.
 *
 *	2) The AUXC table is approximately 1 byte per QP.
 *
 *	3) ICM memory for AUXC, ALTC, and RDB is allocated when
 *	the ICM memory for the corresponding QPC is allocated.
 *
 *	4) ICM memory for the CMPT corresponding to the various primary
 *	resources (QPC, SRQC, CQC, and EQC) is allocated when the ICM
 *	memory for the primary resource is allocated.
 *
 * One MCXNEX page (4KB) would typically map 4K QPs worth of AUXC.
 * So, the minimum chunk for the various QPC related ICM memory should
 * all be allocated to support the 4K QPs.  Currently, this means the
 * amount of memory for the various QP chunks is:
 *
 *	QPC	256*4K bytes
 *	RDB	128*4K bytes
 *	CMPT	 64*4K bytes
 *	ALTC	 64*4K bytes
 *	AUXC	  1*4K bytes
 *
 * The span_size chosen for the QP resource is 4KB of AUXC entries,
 * or 1 MCXNEX_PAGESIZE worth, which is the minimum ICM mapping size.
 *
 * Other ICM resources can have their span_size be more arbitrary.
 * This is 4K (MCXNEX_ICM_SPAN), except for MTTs because they are tiny.
 */

/* macro to make the code below cleaner */
#define	init_dependent(rsrc, dep)				\
	icm[dep].span		= icm[rsrc].span;		\
	icm[dep].num_spans	= icm[rsrc].num_spans;		\
	icm[dep].split_shift	= icm[rsrc].split_shift;	\
	icm[dep].span_mask	= icm[rsrc].span_mask;		\
	icm[dep].span_shift	= icm[rsrc].span_shift;		\
	icm[dep].rsrc_mask	= icm[rsrc].rsrc_mask;

static void
mcxnex_icm_tables_init(mcxnex_state_t *state)
{
	mcxnex_icm_table_t	*icm;
	int			i, k;
	uint32_t		per_split;


	icm = state->hs_icm;

	for (i = 0; i < MCXNEX_NUM_ICM_RESOURCES; i++) {
		icm[i].icm_type		= i;
		icm[i].num_entries	= 1 << icm[i].log_num_entries;
		icm[i].log_object_size	= highbit(icm[i].object_size) - 1;
		icm[i].table_size	= icm[i].num_entries <<
		    icm[i].log_object_size;

		/* deal with "dependent" resource types */
		switch (i) {
		case MCXNEX_AUXC:
#ifdef MCXNEXUS_FW_WORKAROUND
			icm[i].table_size = 0x80000000ull;
			/* FALLTHROUGH */
#endif
		case MCXNEX_CMPT_QPC:
		case MCXNEX_RDB:
		case MCXNEX_ALTC:
			init_dependent(MCXNEX_QPC, i);
			continue;
		case MCXNEX_CMPT_SRQC:
			init_dependent(MCXNEX_SRQC, i);
			continue;
		case MCXNEX_CMPT_CQC:
			init_dependent(MCXNEX_CQC, i);
			continue;
		case MCXNEX_CMPT_EQC:
			init_dependent(MCXNEX_EQC, i);
			continue;
		}

		icm[i].span = MCXNEX_ICM_SPAN;	/* default #rsrc's in 1 span */
		if (i == MCXNEX_MTT) /* Alloc enough MTTs to map 256MB */
			icm[i].span = MCXNEX_ICM_SPAN * 16;
		icm[i].num_spans = icm[i].num_entries / icm[i].span;
		if (icm[i].num_spans == 0) {
			icm[i].span = icm[i].num_entries;
			per_split = 1;
			icm[i].num_spans = icm[i].num_entries / icm[i].span;
		} else {
			per_split = icm[i].num_spans / MCXNEX_ICM_SPLIT;
			if (per_split == 0) {
				per_split = 1;
			}
		}

		/*
		 * Ensure a minimum table size of an ICM page, and a
		 * maximum span size of the ICM table size.  This ensures
		 * that we don't have less than an ICM page to map, which is
		 * impossible, and that we will map an entire table at
		 * once if it's total size is less than the span size.
		 */
		icm[i].table_size = max(icm[i].table_size, MCXNEX_PAGESIZE);

		icm[i].span_shift = 0;
		for (k = icm[i].span; k != 1; k >>= 1)
			icm[i].span_shift++;
		icm[i].split_shift = icm[i].span_shift;
		for (k = per_split; k != 1; k >>= 1)
			icm[i].split_shift++;
		icm[i].span_mask = (1 << icm[i].split_shift) -
		    (1 << icm[i].span_shift);
		icm[i].rsrc_mask = (1 << icm[i].span_shift) - 1;

		DTRACE_PROBE3(mcxnex__icm_resource_spans,
		    mcxnex_state_t *, state,
		    int, i,
		    mcxnex_icm_table_t *, &icm[i]);


		/* Initialize the table lock */
		mutex_init(&icm[i].icm_table_lock, NULL, MUTEX_DRIVER,
		    DDI_INTR_PRI(state->hs_intrmsi_pri));
		cv_init(&icm[i].icm_table_cv, NULL, CV_DRIVER, NULL);
	}

}

/*
 * mcxnex_icm_tables_fini()
 *    Context: Only called from attach() path context
 *
 * Clean up all icm_tables.  Free the bitmap and dma_info arrays.
 */
static void
mcxnex_icm_tables_fini(mcxnex_state_t *state)
{
	mcxnex_icm_table_t	*icm;
	int			nspans;
	int			i, j;


	icm = state->hs_icm;

	for (i = 0; i < MCXNEX_NUM_ICM_RESOURCES; i++) {

		mutex_enter(&icm[i].icm_table_lock);
		nspans = icm[i].num_spans;

		for (j = 0; j < MCXNEX_ICM_SPLIT; j++) {
			if (icm[i].icm_dma[j])
				/* Free the ICM DMA slots */
				kmem_free(icm[i].icm_dma[j],
				    nspans * sizeof (mcxnex_dma_info_t));

			if (icm[i].icm_bitmap[j])
				/* Free the table bitmap */
				kmem_free(icm[i].icm_bitmap[j],
				    (nspans + 7) / 8);
		}
		/* Destroy the table lock */
		cv_destroy(&icm[i].icm_table_cv);
		mutex_exit(&icm[i].icm_table_lock);
		mutex_destroy(&icm[i].icm_table_lock);
	}

}

/*
 * mcxnex_icm_dma_init()
 *    Context: Only called from attach() path context
 */
static int
mcxnex_icm_dma_init(mcxnex_state_t *state)
{
	mcxnex_icm_table_t	*icm;
	mcxnex_rsrc_type_t	type;
	int			status;


	/*
	 * This routine will allocate initial ICM DMA resources for ICM
	 * tables that have reserved ICM objects. This is the only routine
	 * where we should have to allocate ICM outside of mcxnex_rsrc_alloc().
	 * We need to allocate ICM here explicitly, rather than in
	 * mcxnex_rsrc_alloc(), because we've not yet completed the resource
	 * pool initialization. When the resource pools are initialized
	 * (in mcxnex_rsrc_init_phase2(), see mcxnex_rsrc.c for more
	 * information), resource preallocations will be invoked to match
	 * the ICM allocations seen here. We will then be able to use the
	 * normal allocation path.  Note we don't need to set a refcnt on
	 * these initial allocations because that will be done in the calls
	 * to mcxnex_rsrc_alloc() from mcxnex_hw_entries_init() for the
	 * "prealloc" objects (see mcxnex_rsrc.c for more information).
	 */
	for (type = 0; type < MCXNEX_NUM_ICM_RESOURCES; type++) {

		/* ICM for these is allocated within mcxnex_icm_alloc() */
		switch (type) {
		case MCXNEX_CMPT:
		case MCXNEX_CMPT_QPC:
		case MCXNEX_CMPT_SRQC:
		case MCXNEX_CMPT_CQC:
		case MCXNEX_CMPT_EQC:
		case MCXNEX_AUXC:
		case MCXNEX_ALTC:
		case MCXNEX_RDB:
			continue;
		}

		icm = &state->hs_icm[type];

		mutex_enter(&icm->icm_table_lock);
		status = mcxnex_icm_alloc(state, type, 0, 0);
		mutex_exit(&icm->icm_table_lock);
		if (status != DDI_SUCCESS) {
			while (type--) {
				icm = &state->hs_icm[type];
				mutex_enter(&icm->icm_table_lock);
				mcxnex_icm_free(state, type, 0, 0);
				mutex_exit(&icm->icm_table_lock);
			}
			return (DDI_FAILURE);
		}
	}

	return (DDI_SUCCESS);
}

