Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
/*
 * mcxnex_icm_dma_fini()
 *    Context: Only called from attach() path context
 *
 * ICM has been completely unmapped.  We just free the memory here.
 */
static void
mcxnex_icm_dma_fini(mcxnex_state_t *state)
{
	mcxnex_icm_table_t	*icm;
	mcxnex_dma_info_t	*dma_info;
	mcxnex_rsrc_type_t	type;
	int			index1, index2;


	for (type = 0; type < MCXNEX_NUM_ICM_RESOURCES; type++) {
		icm = &state->hs_icm[type];
		for (index1 = 0; index1 < MCXNEX_ICM_SPLIT; index1++) {
			dma_info = icm->icm_dma[index1];
			if (dma_info == NULL)
				continue;
			for (index2 = 0; index2 < icm->num_spans; index2++) {
				if (dma_info[index2].dma_hdl)
					mcxnex_dma_free(&dma_info[index2]);
				dma_info[index2].dma_hdl = NULL;
			}
		}
	}

}

/*
 * mcxnex_hca_ports_shutdown()
 *    Context: Only called from attach() and/or detach() path contexts
 */
static int
mcxnex_hca_ports_shutdown(mcxnex_state_t *state, uint_t num_init)
{
	int	i, status;

	/*
	 * Post commands to shutdown all init'd Mcxnex HCA ports.  Note: if
	 * any of these commands fail for any reason, it would be entirely
	 * unexpected and probably indicative a serious problem (HW or SW).
	 * Although we do return void from this function, this type of failure
	 * should not go unreported.  That is why we have the warning message.
	 */
	for (i = 0; i < num_init; i++) {
		status = mcxnex_close_port_cmd_post(state, i + 1, DDI_NOSLEEP);
		if (status != MCXNEX_CMD_SUCCESS) {
			MCXNEX_WARNING(state, "failed to shutdown HCA port, %d",
			    status);
			return (status);
		}
	}
	return (MCXNEX_CMD_SUCCESS);
}


/*
 * mcxnex_internal_uarpg_init
 *    Context: Only called from attach() path context
 */
static int
mcxnex_internal_uarpg_init(mcxnex_state_t *state)
{
	int	status;
	mcxnex_dbr_info_t 	*info;

	/*
	 * Allocate the UAR page for kernel use. This UAR page is
	 * the privileged UAR page through which all kernel generated
	 * doorbells will be rung. There are a number of UAR pages
	 * reserved by hardware at the front of the UAR BAR, indicated
	 * by DEVCAP.num_rsvd_uar, which we have already allocated. So,
	 * the kernel page, or UAR page index num_rsvd_uar, will be
	 * allocated here for kernel use.
	 */

	status = mcxnex_rsrc_alloc(state, MCXNEX_UARPG, 1, DDI_SLEEP,
	    &state->hs_uarkpg_rsrc);
	if (status != DDI_SUCCESS) {
		return (DDI_FAILURE);
	}

	/* Setup pointer to kernel UAR page */
	state->hs_uar = (mcxnex_hw_uar_t *)state->hs_uarkpg_rsrc->hr_addr;

	/* need to set up DBr tracking as well */
	status = mcxnex_dbr_page_alloc(state, &info);
	if (status != DDI_SUCCESS) {
		return (DDI_FAILURE);
	}
	state->hs_kern_dbr = info;
	return (DDI_SUCCESS);
}


/*
 * mcxnex_internal_uarpg_fini
 *    Context: Only called from attach() and/or detach() path contexts
 */
static void
mcxnex_internal_uarpg_fini(mcxnex_state_t *state)
{
	/* Free up Mcxnex UAR page #1 (kernel driver doorbells) */
	mcxnex_rsrc_free(state, &state->hs_uarkpg_rsrc);
}


/*
 * mcxnex_special_qp_contexts_reserve()
 *    Context: Only called from attach() path context
 */
static int
mcxnex_special_qp_contexts_reserve(mcxnex_state_t *state)
{
	mcxnex_rsrc_t	*qp0_rsrc, *qp1_rsrc, *qp_resvd;
	int		status;

	/* Initialize the lock used for special QP rsrc management */
	mutex_init(&state->hs_spec_qplock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	/*
	 * Reserve contexts for QP0.  These QP contexts will be setup to
	 * act as aliases for the real QP0.  Note: We are required to grab
	 * two QPs (one per port) even if we are operating in single-port
	 * mode.
	 */
	status = mcxnex_rsrc_alloc(state, MCXNEX_QPC, 2, DDI_SLEEP, &qp0_rsrc);
	if (status != DDI_SUCCESS) {
		mutex_destroy(&state->hs_spec_qplock);
		return (DDI_FAILURE);
	}
	state->hs_spec_qp0 = qp0_rsrc;

	/*
	 * Reserve contexts for QP1.  These QP contexts will be setup to
	 * act as aliases for the real QP1.  Note: We are required to grab
	 * two QPs (one per port) even if we are operating in single-port
	 * mode.
	 */
	status = mcxnex_rsrc_alloc(state, MCXNEX_QPC, 2,
	    DDI_SLEEP, &qp1_rsrc);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_free(state, &qp0_rsrc);
		mutex_destroy(&state->hs_spec_qplock);
		return (DDI_FAILURE);
	}
	state->hs_spec_qp1 = qp1_rsrc;

	status = mcxnex_rsrc_alloc(state, MCXNEX_QPC, 4,
	    DDI_SLEEP, &qp_resvd);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_free(state, &qp1_rsrc);
		mcxnex_rsrc_free(state, &qp0_rsrc);
		mutex_destroy(&state->hs_spec_qplock);
		return (DDI_FAILURE);
	}
	state->hs_spec_qp_unused = qp_resvd;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_special_qp_contexts_unreserve()
 *    Context: Only called from attach() and/or detach() path contexts
 */
static void
mcxnex_special_qp_contexts_unreserve(mcxnex_state_t *state)
{

	/* Unreserve contexts for spec_qp_unused */
	mcxnex_rsrc_free(state, &state->hs_spec_qp_unused);

	/* Unreserve contexts for QP1 */
	mcxnex_rsrc_free(state, &state->hs_spec_qp1);

	/* Unreserve contexts for QP0 */
	mcxnex_rsrc_free(state, &state->hs_spec_qp0);

	/* Destroy the lock used for special QP rsrc management */
	mutex_destroy(&state->hs_spec_qplock);
}


/*
 * mcxnex_sw_reset()
 *    Context: Currently called only from attach() path context
 */
static int
mcxnex_sw_reset(mcxnex_state_t *state)
{
	ddi_acc_handle_t	hdl = mcxnex_get_pcihdl(state);
	ddi_acc_handle_t	cmdhdl = mcxnex_get_cmdhdl(state);
	uint32_t		reset_delay;
	int			status, i;
	uint32_t		sem;
	uint_t			offset;
	uint32_t		data32;		/* for devctl & linkctl */
	int			loopcnt;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);
	mcxnex_pio_init(fm_loop_cnt2, fm_status2, fm_test2);

	/*
	 * If the configured software reset delay is set to zero, then we
	 * will not attempt a software reset of the Mcxnex device.
	 */
	reset_delay = state->hs_cfg_profile->cp_sw_reset_delay;
	if (reset_delay == 0) {
		return (DDI_SUCCESS);
	}

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, cmdhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);
	mcxnex_pio_start(state, hdl, pio_error2, fm_loop_cnt2, fm_status2,
	    fm_test2);

	/* Query the PCI capabilities of the HCA device */
	/* but don't process the VPD until after reset */
	status = mcxnex_pci_capability_list(state, hdl);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state,
		    "failed to get pci capabilities list (%x)", status);
		return (DDI_FAILURE);
	}

