Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex.c
	/*
	 * PCI Express Capability - we saved during capability list, and
	 * we'll restore them here.
	 */
	offset = state->hs_pci_cap_offset;
	data32 = state->hs_pci_cap_devctl;
	pci_config_put32(pcihdl, offset + MCXNEX_PCI_CAP_DEV_OFFS, data32);
	data32 = state->hs_pci_cap_lnkctl;
	pci_config_put32(pcihdl, offset + MCXNEX_PCI_CAP_LNK_OFFS, data32);

	/* restore the command register */
	pci_config_put32(pcihdl, 0x04, (state->hs_cfg_data[1] | 0x0006));

	return (DDI_SUCCESS);
}

static dev_info_t *
mcxnex_find_child(dev_info_t *parent, const char *name, int addr)
{
	dev_info_t	*child;
	uint_t		nregs;
	int		*regs;
	int		reg;

	for (child = ddi_get_child(parent);
	    child != NULL;
	    child = ddi_get_next_sibling(child)) {
		if (strcmp(ddi_node_name(child), name) != 0)
			continue;
		if (ddi_prop_lookup_int_array(DDI_DEV_T_ANY, child,
		    DDI_PROP_DONTPASS, "reg", &regs, &nregs) !=
		    DDI_PROP_SUCCESS)
			continue;
		reg = *regs;
		ddi_prop_free(regs);
		if (addr == reg) {
			break;
		}
	}
	return (child);
}

static int
mcxnex_bus_config(dev_info_t *dip, uint_t flags, ddi_bus_config_op_t op,
    void *arg, dev_info_t **cdipp)
{
	mcxnex_state_t	*state = ddi_get_driver_private(dip);
	int		circ;

	ndi_devi_enter(dip, &circ);

	/*
	 * We want to register ethernet ports.  For now we hard code
	 * some basic assumptions -- that we are always handling
	 * ethernet for each port.  This assumption will probably need
	 * to be fixed later.
	 */
	for (int i = 0; i < state->hs_devlim.num_ports; i++) {
		if (!mcxnex_stat_cfg_is_port_enabled(state, i + 1))
			continue;	/* the port is disabled */

		if (mcxnex_attach_ether(state, i) != DDI_SUCCESS) {
			MCXNEX_WARNING(state,
			    "ethernet port %d not attached", i);
		}
	}

	ndi_devi_exit(dip, circ);

	return (ndi_busop_bus_config(dip, flags, op, arg, cdipp, 0));
}


static int
mcxnex_attach_ether(mcxnex_state_t *state, int port)
{
	/*
	 * We want to register ethernet ports.  For now we hard code
	 * some basic assumptions -- that we are always handling
	 * ethernet for each port.  This assumption will probably need
	 * to be fixed later.
	 */
	dev_info_t *cdip;
	dev_info_t *dip = state->hs_dip;

	if ((cdip = mcxnex_find_child(dip, "mcxe", port)) == NULL) {
		if (ndi_devi_alloc(dip, "mcxe", DEVI_SID_NODEID, &cdip) !=
		    NDI_SUCCESS) {
			MCXNEX_WARNING(state,
			    "ndi_devi_alloc failed for ethernet port %d",
			    port);
			return (DDI_FAILURE);
		}

		/* Setup properties for the children. */
		(void) ndi_prop_update_int(DDI_DEV_T_NONE, cdip, "pm-capable",
		    1);
		/* This property required for netboot! */
		(void) ndi_prop_update_string(DDI_DEV_T_NONE,  cdip, "model",
		    "Ethernet controller");
		(void) ndi_prop_update_int_array(DDI_DEV_T_NONE, cdip, "reg",
		    &port, 1);

		(void) ndi_devi_bind_driver(cdip, 0);
	}
	return (DDI_SUCCESS);
}

static int
mcxnex_bus_ctl(dev_info_t *dip, dev_info_t *rdip, ddi_ctl_enum_t ctlop,
    void *arg, void *result)
{
	switch (ctlop) {
	case DDI_CTLOPS_REPORTDEV:
	{
		cmn_err(CE_CONT, "?ConnectX2-device: %s@%s, %s%d\n",
		    ddi_node_name(rdip), ddi_get_name_addr(rdip),
		    ddi_driver_name(rdip), ddi_get_instance(rdip));

		return (DDI_SUCCESS);
	}

	case DDI_CTLOPS_INITCHILD:
	{
		dev_info_t	*child_dip = (dev_info_t *)arg;
		dev_info_t	*parent;
		mcxnex_state_t	*state;
		char		addr[16];
		int		port;
		int		*reg;
		uint_t		reglen;

		if (ddi_prop_lookup_int_array(DDI_DEV_T_ANY, child_dip,
		    DDI_PROP_DONTPASS, "reg", &reg, &reglen) !=
		    DDI_PROP_SUCCESS) {
			return (DDI_NOT_WELL_FORMED);
		}
		ASSERT(reglen == 1);
		port = *reg;
		ddi_prop_free(reg);

		if ((parent = ddi_get_parent(child_dip)) == NULL) {
			return (DDI_NOT_WELL_FORMED);
		}
		if ((state = ddi_get_driver_private(parent)) == NULL) {
			return (DDI_NOT_WELL_FORMED);
		}

		/* Stash a pointer to our own state. */
		ddi_set_parent_data(child_dip, &state->hs_ppd[port]);

		/*
		 * Stash the address in the devinfo node.
		 */
		(void) snprintf(addr, sizeof (addr), "%x", port);
		ddi_set_name_addr(child_dip, addr);

		return (DDI_SUCCESS);
	}

	case DDI_CTLOPS_UNINITCHILD:
	{
		dev_info_t	*child_dip = (dev_info_t *)arg;

		/*
		 * Don't use NDI prop remove, so that we retain the underlying
		 * HW_DEF properties... specifically "reg".
		 */
		ddi_prop_remove_all(child_dip);
		ddi_set_name_addr(child_dip, NULL);
		ddi_set_parent_data(child_dip, NULL);
		return (DDI_SUCCESS);
	}

	case DDI_CTLOPS_SIDDEV:
		/*
		 * Target devices are self-identifying.
		 */
		return (DDI_SUCCESS);

	case DDI_CTLOPS_AFFINITY:
		/*
		 * NB: We may want to revisit this later, so that functions
		 * on one card can see other functions on the same card.
		 * Right now there is no need.
		 */
		return (DDI_FAILURE);

	case DDI_CTLOPS_REPORTINT:
	case DDI_CTLOPS_POKE:
	case DDI_CTLOPS_PEEK:
	case DDI_CTLOPS_NREGS:
	case DDI_CTLOPS_REGSIZE:
		/*
		 * We don't support any of these (yet?).
		 */
		return (DDI_FAILURE);

	default:
		/*
		 * Everything else goes to the parent nexus.
		 */
		return (ddi_ctlops(dip, rdip, ctlop, arg, result));
	}
}

static int
mcxnex_bus_unconfig(dev_info_t *dip, uint_t flags, ddi_bus_config_op_t op,
    void *arg)
{
	/*
	 * The NDI_UNCONFIG flag allows the reference count on this nexus to be
	 * decremented when children's drivers are unloaded, enabling the nexus
	 * itself to be unloaded.
	 */
	return (ndi_busop_bus_unconfig(dip, flags | NDI_UNCONFIG, op, arg));
}

void
mcxnex_printf(mcxnex_state_t *state, int level, const char *fmt, ...)
{
	va_list	va;
	char	newfmt[128];

	(void) snprintf(newfmt, sizeof (newfmt), "!%s%d: %s",
	    ddi_driver_name(state->hs_dip), ddi_get_instance(state->hs_dip),
	    fmt);

	va_start(va, fmt);
	vcmn_err(level, newfmt, va);
	va_end(va);
}
